uni/politikwissenschaft/Textanalyse/07_Grundlagen_der_automatischen_Textanalyse/notes_lucas.org
#+SETUPFILE: ~/.emacs.d/org-html-themes/setup/theme-readtheorg.setup
* Computer-Assisted Text Analysis for Comparative Politics
:PROPERTIES:
:NOTER_DOCUMENT: Lucas_et_al_2015.pdf
:END:
* Introduction
:PROPERTIES:
:NOTER_PAGE: 2
:END:
- Fokus auf Tools für Komparatisten, um /textual/ data zu nutzen
- Hervorhebung des /unsupervised topic modeling/
- Verwendung des Structural Topic Model um das Potential von Topic Modeling für vergleichende Politik aufzuzeigen
  - STM erlaubt Rückschlüsse auf Beziehung zw Metadaten und Textkorpus
- wie unterscheidet sich Textanalyse und Text Processing in versch Sprachen
  - R package `translateR`
* Text and Language Basics
:PROPERTIES:
:NOTER_PAGE: (2)
:END:
** Research Questions and Data Analysis
:PROPERTIES:
:NOTER_PAGE: (2 . 0.762656147271532)
:END:
- automatische Inhaltsanalyse und vergleichende Politik sind eine gute Kombination
- Länder produzieren Texte in noch nie dagewesenem Umfang
- traditionelle Regierungsstatistiken sind häufig nicht vorhanden, unvollständig, manipuliert oder falsch gemessen 
  - Regierungen produzieren allerdings große Mengen an Textdaten, welche für deskriptive und kausale Inferenzen genutzt werden können
  - Anreiz für Gelehrte andere Formen von Data zu verwenden
- Gelehrte der vergleichenden Regierungslehre/Politik verwenden bereits automatische Methoden für Textanalysen
  - weitverbreiteste Form von Text zu Politiker sind wahrscheinlich Aufzeichnungen von Reden oder anderen Statements
- Auflistung einiger interessanten Studien die automatische Textanalyse ultilisiert haben
** Text Processing Basics: A Multilanguage View
:PROPERTIES:
:NOTER_PAGE: (3 . 0.8152531229454306)
:END:
- Analytiker muss zuerst sicherstellen das zu analysierender Text maschinell lesbar ist
  - statistische Methoden der Textanalyse sind meist unabhängig von der Sprache
    - aber Tools des Prepocessings /nicht/

3 Herausforderungen bei der Arbeit mit verschiedenen Sprachen:
1. Umgang mit Zeichenkodierung (dealing with encodings)
2. Präprozessing zur Reduktion der Dimensionalität
3. Umgang mit großen Korpora
** Umgang mit Encodings
:PROPERTIES:
:NOTER_PAGE: 4
:END:
- Sprachen können unterschiedliche Zeichenkodierung haben und unterschiedliche Computer händeln dies auf underschiedliche Art & Weise
  - unterschiedliche default encodings
- wenn der Analyst Daten aus versch Quellen bezieht ist es von nöten, dass das Encoding angepasst wird, sodass es in allen Dokumenten gleich ist 
  - anschließend muss sichergestellt werden, dass die Software die Zeichenkodierung korrekt liest

** Prepocessing to extract the most information
:PROPERTIES:
:NOTER_PAGE: 4
:END:
*** Stopword removal
- Entfernung von Worten die extrem häufig auftreten aber nicht relevant im Bezug auf das Erkenntnisinteresse sind (zb "and", "the", "und", "zum")
  - viele Sprachen haben eine Liste üblicher stop words
- eine Liste von stop words die entfernt werden, sollte sorgfältig gewählt werden, da unterschiedliche stop words zu unterschiedlichen Ergebnissen führen können und manchmal im Kontext entscheidend sein können
