uni/politikwissenschaft/Textanalyse/07_Grundlagen_der_automatischen_Textanalyse/notes_lucas.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2018-06-03 Sun 14:34 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>&lrm;</title>
<meta name="generator" content="Org mode" />
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/htmlize.css"/>
<link rel="stylesheet" type="text/css" href="https://www.pirilampo.org/styles/readtheorg/css/readtheorg.css"/>
</head>
<body>
<div id="content">
<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#org764bb26">1. Computer-Assisted Text Analysis for Comparative Politics</a></li>
<li><a href="#org96d4f46">2. Introduction</a></li>
<li><a href="#orgfced564">3. Text and Language Basics</a>
<ul>
<li><a href="#org49662f8">3.1. Research Questions and Data Analysis</a></li>
<li><a href="#org454255c">3.2. Text Processing Basics: A Multilanguage View</a></li>
<li><a href="#org8dd317b">3.3. Umgang mit Encodings</a></li>
<li><a href="#orgeb0858c">3.4. Prepocessing to extract the most information</a>
<ul>
<li><a href="#orgb77e8f9">3.4.1. Stopword removal</a></li>
<li><a href="#orgd2f4415">3.4.2. Stemming &amp; lemmatization</a></li>
<li><a href="#org93a38d1">3.4.3. Compound words</a></li>
<li><a href="#org0c65fea">3.4.4. Segmentation</a></li>
</ul>
</li>
<li><a href="#orgb991b50">3.5. Building the document-term matrix</a></li>
<li><a href="#orgc587181">3.6. Multilanguage Preprocessing Tools</a>
<ul>
<li><a href="#org2e2b3fe">3.6.1. Language-specific processing</a></li>
<li><a href="#org1f41a92">3.6.2. Translation</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org6eb3569">4. Computer-Assisted Text Analysis</a>
<ul>
<li><a href="#org8e48205">4.1. A Brief Overview of Approaches</a></li>
<li><a href="#org855d1f7">4.2. Multilangual Text Modeling</a></li>
<li><a href="#org02fd6aa">4.3. The STM</a>
<ul>
<li><a href="#orgf9235de">4.3.1. Rolle von Covariates (unabhängigen Variablen)</a></li>
<li><a href="#orgbe3ecb5">4.3.2. Topic correlations</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1acc165">5. Applications</a>
<ul>
<li><a href="#org6ca470d">5.1. Jihadi Fatwas</a></li>
<li><a href="#org4565e56">5.2. Reaktionen auf Snowden in China und in Nahost</a>
<ul>
<li><a href="#org7a66687">5.2.1. Two approaches to machine translation</a></li>
<li><a href="#orgf4439f8">5.2.2. Correcting for systematic differences between languages</a></li>
<li><a href="#orgc56dd7c">5.2.3. Results</a></li>
</ul>
</li>
</ul>
</li>
<li><a href="#org1bf4fd0">6. Conclusion</a></li>
</ul>
</div>
</div>
<div id="outline-container-org764bb26" class="outline-2">
<h2 id="org764bb26"><span class="section-number-2">1</span> Computer-Assisted Text Analysis for Comparative Politics</h2>
<div class="outline-text-2" id="text-1">
</div>
</div>
<div id="outline-container-org96d4f46" class="outline-2">
<h2 id="org96d4f46"><span class="section-number-2">2</span> Introduction</h2>
<div class="outline-text-2" id="text-2">
<ul class="org-ul">
<li>Fokus auf Tools für Komparatisten, um <i>textual</i> data zu nutzen</li>
<li>Hervorhebung des <i>unsupervised topic modeling</i></li>
<li>Verwendung des Structural Topic Model um das Potential von Topic Modeling für vergleichende Politik aufzuzeigen
<ul class="org-ul">
<li>STM erlaubt Rückschlüsse auf Beziehung zw Metadaten und Textkorpus</li>
</ul></li>
<li>wie unterscheidet sich Textanalyse und Text Processing in versch Sprachen
<ul class="org-ul">
<li>R package `translateR`</li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-orgfced564" class="outline-2">
<h2 id="orgfced564"><span class="section-number-2">3</span> Text and Language Basics</h2>
<div class="outline-text-2" id="text-3">
</div>
<div id="outline-container-org49662f8" class="outline-3">
<h3 id="org49662f8"><span class="section-number-3">3.1</span> Research Questions and Data Analysis</h3>
<div class="outline-text-3" id="text-3-1">
<ul class="org-ul">
<li>automatische Inhaltsanalyse und vergleichende Politik sind eine gute Kombination</li>
<li>Länder produzieren Texte in noch nie dagewesenem Umfang</li>
<li>traditionelle Regierungsstatistiken sind häufig nicht vorhanden, unvollständig, manipuliert oder falsch gemessen 
<ul class="org-ul">
<li>Regierungen produzieren allerdings große Mengen an Textdaten, welche für deskriptive und kausale Inferenzen genutzt werden können</li>
<li>Anreiz für Gelehrte andere Formen von Data zu verwenden</li>
</ul></li>
<li>Gelehrte der vergleichenden Regierungslehre/Politik verwenden bereits automatische Methoden für Textanalysen
<ul class="org-ul">
<li>weitverbreiteste Form von Text zu Politiker sind wahrscheinlich Aufzeichnungen von Reden oder anderen Statements</li>
</ul></li>
<li>Auflistung einiger interessanten Studien die automatische Textanalyse ultilisiert haben</li>
</ul>
</div>
</div>
<div id="outline-container-org454255c" class="outline-3">
<h3 id="org454255c"><span class="section-number-3">3.2</span> Text Processing Basics: A Multilanguage View</h3>
<div class="outline-text-3" id="text-3-2">
<ul class="org-ul">
<li>Analytiker muss zuerst sicherstellen das zu analysierender Text maschinell lesbar ist
<ul class="org-ul">
<li>statistische Methoden der Textanalyse sind meist unabhängig von der Sprache
<ul class="org-ul">
<li>aber Tools des Prepocessings <i>nicht</i></li>
</ul></li>
</ul></li>
</ul>

<p>
3 Herausforderungen bei der Arbeit mit verschiedenen Sprachen:
</p>
<ol class="org-ol">
<li>Umgang mit Zeichenkodierung (dealing with encodings)</li>
<li>Präprozessing zur Reduktion der Dimensionalität</li>
<li>Umgang mit großen Korpora</li>
</ol>
</div>
</div>
<div id="outline-container-org8dd317b" class="outline-3">
<h3 id="org8dd317b"><span class="section-number-3">3.3</span> Umgang mit Encodings</h3>
<div class="outline-text-3" id="text-3-3">
<ul class="org-ul">
<li>Sprachen können unterschiedliche Zeichenkodierung haben und unterschiedliche Computer händeln dies auf underschiedliche Art &amp; Weise
<ul class="org-ul">
<li>unterschiedliche default encodings</li>
</ul></li>
<li>wenn der Analyst Daten aus versch Quellen bezieht ist es von nöten, dass das Encoding angepasst wird, sodass es in allen Dokumenten gleich ist 
<ul class="org-ul">
<li>anschließend muss sichergestellt werden, dass die Software die Zeichenkodierung korrekt liest</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-orgeb0858c" class="outline-3">
<h3 id="orgeb0858c"><span class="section-number-3">3.4</span> Prepocessing to extract the most information</h3>
<div class="outline-text-3" id="text-3-4">
</div>
<div id="outline-container-orgb77e8f9" class="outline-4">
<h4 id="orgb77e8f9"><span class="section-number-4">3.4.1</span> Stopword removal</h4>
<div class="outline-text-4" id="text-3-4-1">
<ul class="org-ul">
<li>Entfernung von Worten die extrem häufig auftreten aber nicht relevant im Bezug auf das Erkenntnisinteresse sind (zb "and", "the", "und", "zum")
<ul class="org-ul">
<li>viele Sprachen haben eine Liste üblicher stop words</li>
</ul></li>
<li>eine Liste von stop words die entfernt werden, sollte sorgfältig gewählt werden, da unterschiedliche stop words zu unterschiedlichen Ergebnissen führen können und manchmal im Kontext entscheidend sein können</li>
</ul>
</div>
</div>
