uni/politikwissenschaft/Textanalyse/07_Grundlagen_der_automatischen_Textanalyse/notes_lucas.tex
% Created 2018-06-03 Sun 14:28
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\date{\today}
\title{}
\hypersetup{
 pdfauthor={},
 pdftitle={},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.0.91 (Org mode 9.1.13)}, 
 pdflang={English}}
\begin{document}

\tableofcontents

\section{Computer-Assisted Text Analysis for Comparative Politics}
\label{sec:org0e95a2d}
\section{Introduction}
\label{sec:org86c6b4e}
\begin{itemize}
\item Fokus auf Tools für Komparatisten, um \emph{textual} data zu nutzen
\item Hervorhebung des \emph{unsupervised topic modeling}
\item Verwendung des Structural Topic Model um das Potential von Topic Modeling für vergleichende Politik aufzuzeigen
\begin{itemize}
\item STM erlaubt Rückschlüsse auf Beziehung zw Metadaten und Textkorpus
\end{itemize}
\item wie unterscheidet sich Textanalyse und Text Processing in versch Sprachen
\begin{itemize}
\item R package `translateR`
\end{itemize}
\end{itemize}
\section{Text and Language Basics}
\label{sec:orgce02cc3}
\subsection{Research Questions and Data Analysis}
\label{sec:org6c3b24c}
\begin{itemize}
\item automatische Inhaltsanalyse und vergleichende Politik sind eine gute Kombination
\item Länder produzieren Texte in noch nie dagewesenem Umfang
\item traditionelle Regierungsstatistiken sind häufig nicht vorhanden, unvollständig, manipuliert oder falsch gemessen 
\begin{itemize}
\item Regierungen produzieren allerdings große Mengen an Textdaten, welche für deskriptive und kausale Inferenzen genutzt werden können
\item Anreiz für Gelehrte andere Formen von Data zu verwenden
\end{itemize}
\item Gelehrte der vergleichenden Regierungslehre/Politik verwenden bereits automatische Methoden für Textanalysen
\begin{itemize}
\item weitverbreiteste Form von Text zu Politiker sind wahrscheinlich Aufzeichnungen von Reden oder anderen Statements
\end{itemize}
\item Auflistung einiger interessanten Studien die automatische Textanalyse ultilisiert haben
\end{itemize}
\subsection{Text Processing Basics: A Multilanguage View}
\label{sec:org99f934c}
\begin{itemize}
\item Analytiker muss zuerst sicherstellen das zu analysierender Text maschinell lesbar ist
\begin{itemize}
\item statistische Methoden der Textanalyse sind meist unabhängig von der Sprache
\begin{itemize}
\item aber Tools des Prepocessings \emph{nicht}
\end{itemize}
\end{itemize}
\end{itemize}

3 Herausforderungen bei der Arbeit mit verschiedenen Sprachen:
\begin{enumerate}
\item Umgang mit Zeichenkodierung (dealing with encodings)
\item Präprozessing zur Reduktion der Dimensionalität
\item Umgang mit großen Korpora
\end{enumerate}
\subsection{Umgang mit Encodings}
\label{sec:org4c43669}
\begin{itemize}
\item Sprachen können unterschiedliche Zeichenkodierung haben und unterschiedliche Computer händeln dies auf underschiedliche Art \& Weise
\begin{itemize}
\item unterschiedliche default encodings
\end{itemize}
\item wenn der Analyst Daten aus versch Quellen bezieht ist es von nöten, dass das Encoding angepasst wird, sodass es in allen Dokumenten gleich ist 
\begin{itemize}
\item anschließend muss sichergestellt werden, dass die Software die Zeichenkodierung korrekt liest
\end{itemize}
\end{itemize}

\subsection{Prepocessing to extract the most information}
\label{sec:org8a34929}
\subsubsection{Stopword removal}
\label{sec:orga6d8710}
\begin{itemize}
\item Entfernung von Worten die extrem häufig auftreten aber nicht relevant im Bezug auf das Erkenntnisinteresse sind (zb "and", "the", "und", "zum")
\begin{itemize}
\item viele Sprachen haben eine Liste üblicher stop words
\end{itemize}
\item eine Liste von stop words die entfernt werden, sollte sorgfältig gewählt werden, da unterschiedliche stop words zu unterschiedlichen Ergebnissen führen können und manchmal im Kontext entscheidend sein können
\end{itemize}
