uni/politikwissenschaft/Textanalyse/07_Grundlagen_der_automatischen_Textanalyse/notes_lucas.html
<div id="outline-container-orgd2f4415" class="outline-4">
<h4 id="orgd2f4415"><span class="section-number-4">3.4.2</span> Stemming &amp; lemmatization</h4>
<div class="outline-text-4" id="text-3-4-2">
<p>
Stemming:
</p>
<ul class="org-ul">
<li>Entfernung der Enden von konjugierten Verben oder Nomen in der Pluralform, so dass nur der "Stamm" überbleibt</li>
<li>nützlich in jeder Sprache in der das Ende von Worten geändert wird für eine Veränderung der Zeit oder Anzahl (Englisch, Spanisch, Französisch etc)</li>
<li>nicht in jeder Sprache nötig/nützlich
<ul class="org-ul">
<li>chinesische Verben werden zB nicht konjugiert und Nomen in chinesisch werden nicht durch eine Endung pluralisiert</li>
</ul></li>
<li>Nützlichkeit ist anwendungs- und sprachabhängig</li>
<li>Stemming ist ein Vefahren/Näherung an ein allgemeineres Ziel was als Lemmatization (Lemmatisierung) bezeichnet wird</li>
</ul>

<p>
Lemmatization:
</p>
<ul class="org-ul">
<li>Identifikation der Grundform eines Wortes und Gruppierung dieser Worte</li>
<li>komplexer Algorithmus, der nicht einfach das Ende eines Wortes abschneidet, sondern die Herkunft des Wortes identifiziert und nur das Lemma (Grundform) des Wortes zurück gibt</li>
<li>kann außerdem Kontext schlussfolgern:
<ul class="org-ul">
<li>zB "saw" als Nomen = "Säge" bleibt so, als Verb = "sah" wird zu &rarr; "sehen/see"</li>
</ul></li>

<li>für Englisch funktioniert Stemming fast so gut wie Lemmatization in anderen Sprachen wie zB Koreanisch oder Türkisch ist Lemmatization hilfreicher</li>
</ul>
</div>
</div>

<div id="outline-container-org93a38d1" class="outline-4">
<h4 id="org93a38d1"><span class="section-number-4">3.4.3</span> Compound words</h4>
<div class="outline-text-4" id="text-3-4-3">
<ul class="org-ul">
<li>einige (compound) Sprachen setzen oft Worte zusammen (compounding) um ein neues Wort zu bilden zB Kirche + Rat = Kirchenrat
<ul class="org-ul">
<li>decompounding macht in diesem Fall keinen Sinn da die Worte zusammengehören</li>
</ul></li>
<li>in decompoung Sprachen widerrum können <i>mehrere</i> getrennte Worte zu <i>einem</i> Konzept gehören:
<ul class="org-ul">
<li>"social security" und "national security"
<ul class="org-ul">
<li>beide enthalten "security" aber haben trotzdem unterschiedliche Bedeutung, daher möchte der Analyst die Worte evtl. compounden (zusammenführen), zu "nationalsecurity" und "socialsecurity", um die Bedeutung an <i>ein</i> Wort zu koppeln</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org0c65fea" class="outline-4">
<h4 id="org0c65fea"><span class="section-number-4">3.4.4</span> Segmentation</h4>
<div class="outline-text-4" id="text-3-4-4">
<ul class="org-ul">
<li>einige Sprachen wie zB Chinesisch werden nicht durch Leerzeichen segmentiert und erfordern deshalb automatische Segmentierung bevor sie von einem Statistikprogramm weiterverarbeitet werden können</li>
</ul>
</div>
</div>
</div>

<div id="outline-container-orgb991b50" class="outline-3">
<h3 id="orgb991b50"><span class="section-number-3">3.5</span> Building the document-term matrix</h3>
<div class="outline-text-3" id="text-3-5">
<ul class="org-ul">
<li>nach dem das Prepocessing abgeschlossen ist, werden die übrig gebliebenen Worte genutzt, um eine document-term matrix (DTM) zu konstruieren</li>
<li>in einer document-term matrix repräsentiert jede Reihe ein Dokument und jede Spalte ein ein einzigartiges Wort
<ul class="org-ul">
<li>jede Zelle enthält die Anzahl des Auftreten des jeweiligen Wortes (Spalte) im jeweiligen Dokument (Reihe)
<ul class="org-ul">
<li>üblicherweise enthalten viele Zellen eine 0</li>
</ul></li>
</ul></li>
</ul>

<p>
Beispiel:
</p>
<table border="2" cellspacing="0" cellpadding="6" rules="groups" frame="hsides">


<colgroup>
<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />

<col  class="org-right" />
</colgroup>
<tbody>
<tr>
<td class="org-right">Berlin</td>
<td class="org-right">Brüssel</td>
<td class="org-right">Merkel</td>
<td class="org-right">Schulz</td>
</tr>

<tr>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
</tr>

<tr>
<td class="org-right">1</td>
<td class="org-right">0</td>
<td class="org-right">1</td>
<td class="org-right">0</td>
</tr>
</tbody>
</table>

<ul class="org-ul">
<li>Reihenfolge der Worte beachtet die DTM nicht</li>
<li>da diese DTM schon bei Korpora moderater Größe sehr groß werden kann, ist es ratsam nur Einträge zu speichern die nicht 0 sind (sparse representation)</li>
<li>die DTM oder ihre sparse representation sind der primäre Input für automatische Textanalysemethoden</li>
</ul>
</div>
</div>
<div id="outline-container-orgc587181" class="outline-3">
<h3 id="orgc587181"><span class="section-number-3">3.6</span> Multilanguage Preprocessing Tools</h3>
<div class="outline-text-3" id="text-3-6">
</div>
<div id="outline-container-org2e2b3fe" class="outline-4">
<h4 id="org2e2b3fe"><span class="section-number-4">3.6.1</span> Language-specific processing</h4>
<div class="outline-text-4" id="text-3-6-1">
<ul class="org-ul">
<li>das R Package `tm` kann Stemming für 11 und stop words removal für 13 Sprachen durchführen</li>
<li>die Python basierde Applikaton `txtorg` unterstützt 32 Sprachen
<ul class="org-ul">
<li>alle Sprachen durchlaufen Schritte des best-practice preprocessing
<ul class="org-ul">
<li>geeignete Kombination von Stemming, Segmentation und stop-word Entfernung</li>
</ul></li>
</ul></li>
</ul>
</div>
</div>
<div id="outline-container-org1f41a92" class="outline-4">
<h4 id="org1f41a92"><span class="section-number-4">3.6.2</span> Translation</h4>
<div class="outline-text-4" id="text-3-6-2">
<ul class="org-ul">
<li>Übersetzung der Dokumente in 1 Sprache kann sich als effizient und zugänglicher für den Nutzer erweisen</li>
<li>cross-lingual comparison wird so gut wie nirgends unterstützt</li>
<li>Empfehlung: R package `translateR` gibt Zugang zu sehr ausgereiften Übersetzungssystemen (jene die produziert sind von Google und Microsoft)</li>
</ul>
</div>
</div>
</div>
</div>
