uni/politikwissenschaft/Textanalyse/07_Grundlagen_der_automatischen_Textanalyse/notes_lucas.tex
\subsubsection{Stemming \& lemmatization}
\label{sec:orgadbecc3}
Stemming:
\begin{itemize}
\item Entfernung der Enden von konjugierten Verben oder Nomen in der Pluralform, so dass nur der "Stamm" überbleibt
\item nützlich in jeder Sprache in der das Ende von Worten geändert wird für eine Veränderung der Zeit oder Anzahl (Englisch, Spanisch, Französisch etc)
\item nicht in jeder Sprache nötig/nützlich
\begin{itemize}
\item chinesische Verben werden zB nicht konjugiert und Nomen in chinesisch werden nicht durch eine Endung pluralisiert
\end{itemize}
\item Nützlichkeit ist anwendungs- und sprachabhängig
\item Stemming ist ein Vefahren/Näherung an ein allgemeineres Ziel was als Lemmatization (Lemmatisierung) bezeichnet wird
\end{itemize}

Lemmatization:
\begin{itemize}
\item Identifikation der Grundform eines Wortes und Gruppierung dieser Worte
\item komplexer Algorithmus, der nicht einfach das Ende eines Wortes abschneidet, sondern die Herkunft des Wortes identifiziert und nur das Lemma (Grundform) des Wortes zurück gibt
\item kann außerdem Kontext schlussfolgern:
\begin{itemize}
\item zB "saw" als Nomen = "Säge" bleibt so, als Verb = "sah" wird zu \(\rightarrow\) "sehen/see"
\end{itemize}

\item für Englisch funktioniert Stemming fast so gut wie Lemmatization in anderen Sprachen wie zB Koreanisch oder Türkisch ist Lemmatization hilfreicher
\end{itemize}

\subsubsection{Compound words}
\label{sec:org30751ed}
\begin{itemize}
\item einige (compound) Sprachen setzen oft Worte zusammen (compounding) um ein neues Wort zu bilden zB Kirche + Rat = Kirchenrat
\begin{itemize}
\item decompounding macht in diesem Fall keinen Sinn da die Worte zusammengehören
\end{itemize}
\item in decompoung Sprachen widerrum können \emph{mehrere} getrennte Worte zu \emph{einem} Konzept gehören:
\begin{itemize}
\item "social security" und "national security"
\begin{itemize}
\item beide enthalten "security" aber haben trotzdem unterschiedliche Bedeutung, daher möchte der Analyst die Worte evtl. compounden (zusammenführen), zu "nationalsecurity" und "socialsecurity", um die Bedeutung an \emph{ein} Wort zu koppeln
\end{itemize}
\end{itemize}
\end{itemize}

\subsubsection{Segmentation}
\label{sec:org331c971}
\begin{itemize}
\item einige Sprachen wie zB Chinesisch werden nicht durch Leerzeichen segmentiert und erfordern deshalb automatische Segmentierung bevor sie von einem Statistikprogramm weiterverarbeitet werden können
\end{itemize}

\subsection{Building the document-term matrix}
\label{sec:orgecdf53c}
\begin{itemize}
\item nach dem das Prepocessing abgeschlossen ist, werden die übrig gebliebenen Worte genutzt, um eine document-term matrix (DTM) zu konstruieren
\item in einer document-term matrix repräsentiert jede Reihe ein Dokument und jede Spalte ein ein einzigartiges Wort
\begin{itemize}
\item jede Zelle enthält die Anzahl des Auftreten des jeweiligen Wortes (Spalte) im jeweiligen Dokument (Reihe)
\begin{itemize}
\item üblicherweise enthalten viele Zellen eine 0
\end{itemize}
\end{itemize}
\end{itemize}

Beispiel:
\begin{center}
\begin{tabular}{rrrr}
Berlin & Brüssel & Merkel & Schulz\\
0 & 1 & 0 & 1\\
1 & 0 & 1 & 0\\
\end{tabular}
\end{center}

\begin{itemize}
\item Reihenfolge der Worte beachtet die DTM nicht
\item da diese DTM schon bei Korpora moderater Größe sehr groß werden kann, ist es ratsam nur Einträge zu speichern die nicht 0 sind (sparse representation)
\item die DTM oder ihre sparse representation sind der primäre Input für automatische Textanalysemethoden
\end{itemize}
\subsection{Multilanguage Preprocessing Tools}
\label{sec:org35cf0ba}
\subsubsection{Language-specific processing}
\label{sec:orgae7009f}
\begin{itemize}
\item das R Package `tm` kann Stemming für 11 und stop words removal für 13 Sprachen durchführen
\item die Python basierde Applikaton `txtorg` unterstützt 32 Sprachen
\begin{itemize}
\item alle Sprachen durchlaufen Schritte des best-practice preprocessing
\begin{itemize}
\item geeignete Kombination von Stemming, Segmentation und stop-word Entfernung
\end{itemize}
\end{itemize}
\end{itemize}
\subsubsection{Translation}
\label{sec:org9c402a9}
\begin{itemize}
\item Übersetzung der Dokumente in 1 Sprache kann sich als effizient und zugänglicher für den Nutzer erweisen
\item cross-lingual comparison wird so gut wie nirgends unterstützt
\item Empfehlung: R package `translateR` gibt Zugang zu sehr ausgereiften Übersetzungssystemen (jene die produziert sind von Google und Microsoft)
\end{itemize}
