uni/politikwissenschaft/Textanalyse/07_Grundlagen_der_automatischen_Textanalyse/notes_lucas.org
** A Brief Overview of Approaches
:PROPERTIES:
:NOTER_PAGE: (7 . 0.8379120879120879)
:END:
zwei Herangehensweisen im Hinblick auf automatische Textanalyse:
1. supervised methods:
   - "specify what is conceptually interesting about documents in advance, and then the model seeks to extend our insights to a larger population of unseen documents"
   - bspw. manuelle Unterteilung/Klassifizierung von 100 Dokumenten in 2 Kategorien \rightarrow und dann automatische Klassifizierung der verbleibenden 9900
2. unsupervised methods:
   - zB topic modeling
   - keine manuelle Klassifizierung der Texte im Voraus
   - das Modell wird benutzt um eine "low-dimensional summary" zu finden, welche die Dokumente am besten erklärt im Hinblick auf zuvor formulierte Annahmen

bei supervised methods liegt der Großteil der von Hand zu verrichtenden Arbeit in der Konstruktion des training sets, bei unsupervised in der Interpretation der model results

Autoren benutzen ein bestimmten Typ des unsupervised topic modeling, welches auf dem Latent Dirichlet Allocation (LDA) model basiert
- LDA = mixed-mempership model
  - d.h jedes Dokument wird repräsentiert als eine Kombination/Mischung aus einem Pool von Themen und jedem Wort, welchem ebenfalls ein bestimmtes Thema zugewiesen wird
- each topic is a distribution over the words in the vocabulary
  - dies wird gelernt und nicht vom model angenommen

** Multilangual Text Modeling
:PROPERTIES:
:NOTER_PAGE: (8 . 0.5906593406593407)
:END:
Herangehensweisen:
1. Analyse in der nativen Sprache des Textes
   - machbar bei supervised Vorgehen (trotzdem aufwändig), aber keine klare Methodik für unsupervised Vorgehen
2. Übersetzung der Texte in eine common Sprache
   - manuelle Übersetzung extrem teuer, daher maschinelle Übersetzung
3. Explicit multilangual representation
   - develop a model which maintains an explicitly multilingual representation
   - Vereinheitlichung der konzeptuellen Models über die versch Sprachen hinweg, sodass scaling und Themen (topics) in der einen Sprache vergleichbar mit den Repräsentationen der anderen Sprache sind

Übereinstimmung(Korrespondenz) mehrsprachiger Topics hängt von /particular alignment informations/ des Anwenders ab und muss (manuell) validiert werden
- für jedes Topic muss überprüft werden, dass topic word distributions über die Sprachen hinweg einheitlich sind
** The STM
:PROPERTIES:
:NOTER_PAGE: (9 . 0.521978021978022)
:END:
- das STM Framework ist ein mixded-membership topic model (so wie LDA) mit dem Zusatz, dass es dokumentabhängige Metadaten berücksichtigen und mit einbeziehen kann
  - kann Qualität der erlernten Topics erhöhen und Hypothesentests erleichtern
  - erhältlich über das R package `stm`
*** Rolle von Covariates (unabhängigen Variablen)
- STM kann im Gegensatz zu LDA "include document-level covariates in the model as a method for pooling information"
*** Topic correlations
- STM kann darüberhinaus die Korrelation von Themen explizit kalkulieren

* Applications 
:PROPERTIES:
:NOTER_PAGE: (10 . 0.7280219780219781)
:END:
Vorstellung von 2 Anwendungsbereichen des STM
1. Analyse von islam. /fatwas/ in nativer Sprache
2. Analyse von Texten in 2 Sprachen (Arabisch & Chinsesisch)
