uni/politikwissenschaft/Textanalyse/07_Grundlagen_der_automatischen_Textanalyse/notes_lucas.html

<div id="outline-container-org6eb3569" class="outline-2">
<h2 id="org6eb3569"><span class="section-number-2">4</span> Computer-Assisted Text Analysis</h2>
<div class="outline-text-2" id="text-4">
</div>
<div id="outline-container-org8e48205" class="outline-3">
<h3 id="org8e48205"><span class="section-number-3">4.1</span> A Brief Overview of Approaches</h3>
<div class="outline-text-3" id="text-4-1">
<p>
zwei Herangehensweisen im Hinblick auf automatische Textanalyse:
</p>
<ol class="org-ol">
<li>supervised methods:
<ul class="org-ul">
<li>"specify what is conceptually interesting about documents in advance, and then the model seeks to extend our insights to a larger population of unseen documents"</li>
<li>bspw. manuelle Unterteilung/Klassifizierung von 100 Dokumenten in 2 Kategorien &rarr; und dann automatische Klassifizierung der verbleibenden 9900</li>
</ul></li>
<li>unsupervised methods:
<ul class="org-ul">
<li>zB topic modeling</li>
<li>keine manuelle Klassifizierung der Texte im Voraus</li>
<li>das Modell wird benutzt um eine "low-dimensional summary" zu finden, welche die Dokumente am besten erklärt im Hinblick auf zuvor formulierte Annahmen</li>
</ul></li>
</ol>

<p>
bei supervised methods liegt der Großteil der von Hand zu verrichtenden Arbeit in der Konstruktion des training sets, bei unsupervised in der Interpretation der model results
</p>

<p>
Autoren benutzen ein bestimmten Typ des unsupervised topic modeling, welches auf dem Latent Dirichlet Allocation (LDA) model basiert
</p>
<ul class="org-ul">
<li>LDA = mixed-mempership model
<ul class="org-ul">
<li>d.h jedes Dokument wird repräsentiert als eine Kombination/Mischung aus einem Pool von Themen und jedem Wort, welchem ebenfalls ein bestimmtes Thema zugewiesen wird</li>
</ul></li>
<li>each topic is a distribution over the words in the vocabulary
<ul class="org-ul">
<li>dies wird gelernt und nicht vom model angenommen</li>
</ul></li>
</ul>
</div>
</div>

<div id="outline-container-org855d1f7" class="outline-3">
<h3 id="org855d1f7"><span class="section-number-3">4.2</span> Multilangual Text Modeling</h3>
<div class="outline-text-3" id="text-4-2">
<p>
Herangehensweisen:
</p>
<ol class="org-ol">
<li>Analyse in der nativen Sprache des Textes
<ul class="org-ul">
<li>machbar bei supervised Vorgehen (trotzdem aufwändig), aber keine klare Methodik für unsupervised Vorgehen</li>
</ul></li>
<li>Übersetzung der Texte in eine common Sprache
<ul class="org-ul">
<li>manuelle Übersetzung extrem teuer, daher maschinelle Übersetzung</li>
</ul></li>
<li>Explicit multilangual representation
<ul class="org-ul">
<li>develop a model which maintains an explicitly multilingual representation</li>
<li>Vereinheitlichung der konzeptuellen Models über die versch Sprachen hinweg, sodass scaling und Themen (topics) in der einen Sprache vergleichbar mit den Repräsentationen der anderen Sprache sind</li>
</ul></li>
</ol>

<p>
Übereinstimmung(Korrespondenz) mehrsprachiger Topics hängt von <i>particular alignment informations</i> des Anwenders ab und muss (manuell) validiert werden
</p>
<ul class="org-ul">
<li>für jedes Topic muss überprüft werden, dass topic word distributions über die Sprachen hinweg einheitlich sind</li>
</ul>
</div>
</div>
<div id="outline-container-org02fd6aa" class="outline-3">
<h3 id="org02fd6aa"><span class="section-number-3">4.3</span> The STM</h3>
<div class="outline-text-3" id="text-4-3">
<ul class="org-ul">
<li>das STM Framework ist ein mixded-membership topic model (so wie LDA) mit dem Zusatz, dass es dokumentabhängige Metadaten berücksichtigen und mit einbeziehen kann
<ul class="org-ul">
<li>kann Qualität der erlernten Topics erhöhen und Hypothesentests erleichtern</li>
<li>erhältlich über das R package `stm`</li>
</ul></li>
</ul>
</div>
<div id="outline-container-orgf9235de" class="outline-4">
<h4 id="orgf9235de"><span class="section-number-4">4.3.1</span> Rolle von Covariates (unabhängigen Variablen)</h4>
<div class="outline-text-4" id="text-4-3-1">
<ul class="org-ul">
<li>STM kann im Gegensatz zu LDA "include document-level covariates in the model as a method for pooling information"</li>
</ul>
</div>
</div>
<div id="outline-container-orgbe3ecb5" class="outline-4">
<h4 id="orgbe3ecb5"><span class="section-number-4">4.3.2</span> Topic correlations</h4>
<div class="outline-text-4" id="text-4-3-2">
<ul class="org-ul">
<li>STM kann darüberhinaus die Korrelation von Themen explizit kalkulieren</li>
</ul>
</div>
</div>
</div>
</div>

<div id="outline-container-org1acc165" class="outline-2">
<h2 id="org1acc165"><span class="section-number-2">5</span> Applications</h2>
<div class="outline-text-2" id="text-5">
<p>
Vorstellung von 2 Anwendungsbereichen des STM
</p>
<ol class="org-ol">
<li>Analyse von islam. <i>fatwas</i> in nativer Sprache</li>
<li>Analyse von Texten in 2 Sprachen (Arabisch &amp; Chinsesisch)</li>
</ol>
</div>
