uni/politikwissenschaft/Textanalyse/07_Grundlagen_der_automatischen_Textanalyse/notes_lucas.tex

\section{Computer-Assisted Text Analysis}
\label{sec:orgd9f30c1}
\subsection{A Brief Overview of Approaches}
\label{sec:org4e91c23}
zwei Herangehensweisen im Hinblick auf automatische Textanalyse:
\begin{enumerate}
\item supervised methods:
\begin{itemize}
\item "specify what is conceptually interesting about documents in advance, and then the model seeks to extend our insights to a larger population of unseen documents"
\item bspw. manuelle Unterteilung/Klassifizierung von 100 Dokumenten in 2 Kategorien \(\rightarrow\) und dann automatische Klassifizierung der verbleibenden 9900
\end{itemize}
\item unsupervised methods:
\begin{itemize}
\item zB topic modeling
\item keine manuelle Klassifizierung der Texte im Voraus
\item das Modell wird benutzt um eine "low-dimensional summary" zu finden, welche die Dokumente am besten erklärt im Hinblick auf zuvor formulierte Annahmen
\end{itemize}
\end{enumerate}

bei supervised methods liegt der Großteil der von Hand zu verrichtenden Arbeit in der Konstruktion des training sets, bei unsupervised in der Interpretation der model results

Autoren benutzen ein bestimmten Typ des unsupervised topic modeling, welches auf dem Latent Dirichlet Allocation (LDA) model basiert
\begin{itemize}
\item LDA = mixed-mempership model
\begin{itemize}
\item d.h jedes Dokument wird repräsentiert als eine Kombination/Mischung aus einem Pool von Themen und jedem Wort, welchem ebenfalls ein bestimmtes Thema zugewiesen wird
\end{itemize}
\item each topic is a distribution over the words in the vocabulary
\begin{itemize}
\item dies wird gelernt und nicht vom model angenommen
\end{itemize}
\end{itemize}

\subsection{Multilangual Text Modeling}
\label{sec:org0491978}
Herangehensweisen:
\begin{enumerate}
\item Analyse in der nativen Sprache des Textes
\begin{itemize}
\item machbar bei supervised Vorgehen (trotzdem aufwändig), aber keine klare Methodik für unsupervised Vorgehen
\end{itemize}
\item Übersetzung der Texte in eine common Sprache
\begin{itemize}
\item manuelle Übersetzung extrem teuer, daher maschinelle Übersetzung
\end{itemize}
\item Explicit multilangual representation
\begin{itemize}
\item develop a model which maintains an explicitly multilingual representation
\item Vereinheitlichung der konzeptuellen Models über die versch Sprachen hinweg, sodass scaling und Themen (topics) in der einen Sprache vergleichbar mit den Repräsentationen der anderen Sprache sind
\end{itemize}
\end{enumerate}

Übereinstimmung(Korrespondenz) mehrsprachiger Topics hängt von \emph{particular alignment informations} des Anwenders ab und muss (manuell) validiert werden
\begin{itemize}
\item für jedes Topic muss überprüft werden, dass topic word distributions über die Sprachen hinweg einheitlich sind
\end{itemize}
\subsection{The STM}
\label{sec:orgf72c7f9}
\begin{itemize}
\item das STM Framework ist ein mixded-membership topic model (so wie LDA) mit dem Zusatz, dass es dokumentabhängige Metadaten berücksichtigen und mit einbeziehen kann
\begin{itemize}
\item kann Qualität der erlernten Topics erhöhen und Hypothesentests erleichtern
\item erhältlich über das R package `stm`
\end{itemize}
\end{itemize}
\subsubsection{Rolle von Covariates (unabhängigen Variablen)}
\label{sec:orgfd41c50}
\begin{itemize}
\item STM kann im Gegensatz zu LDA "include document-level covariates in the model as a method for pooling information"
\end{itemize}
\subsubsection{Topic correlations}
\label{sec:orgf2a1232}
\begin{itemize}
\item STM kann darüberhinaus die Korrelation von Themen explizit kalkulieren
\end{itemize}

\section{Applications}
\label{sec:org3e99371}
Vorstellung von 2 Anwendungsbereichen des STM
\begin{enumerate}
\item Analyse von islam. \emph{fatwas} in nativer Sprache
\item Analyse von Texten in 2 Sprachen (Arabisch \& Chinsesisch)
\end{enumerate}
