uni/politikwissenschaft/Textanalyse/07_Grundlagen_der_automatischen_Textanalyse/notes_lucas.html
<div id="outline-container-org6ca470d" class="outline-3">
<h3 id="org6ca470d"><span class="section-number-3">5.1</span> Jihadi Fatwas</h3>
<div class="outline-text-3" id="text-5-1">
<p>
Kombination von Daten über musl. Gelehrte und Kodierungen im Bezug darauf ob Gelehrte Jihadisten sind, um herauszufinden wie der Themensinhalt von Texten die von jihadist. Gelehrten sich von Nichtjihadisten unterscheiden:
</p>
<ol class="org-ol">
<li>Data von Nielsen: Daten über das Leben und Schriften von 101 bekannten jihad. und nicht-jihad. musl. Gelehrten inklusive 27.248 Texte von diesen
<ul class="org-ul">
<li>Großteil dieser Texte sind fatwas</li>
<li>aber auch Bücher, Artikel und Schriften</li>
<li>diese Texte zeigen wie Gelehrte mit religiösen Konstitutionen(Wählerschichten?) interagieren</li>
</ul></li>
<li>Unabhängige Kodierungen ob diese Gelehrten Jihadistens sind</li>
<li>2 Quellen:
<ul class="org-ul">
<li><i>Militant Ideology Atlas</i> = führt 56 Individuen an die regelmäßig/oft von Jihadisten zitiert werden</li>
<li>Auflistung von bekannten Gelehrten in 8 ideologischen Kategorieren (Jarret Brachman):
<ul class="org-ul">
<li>Salafist, Madkhali Salafist, Albani Salafist, scientific Salafist, Salafist Ikhwan, Sururis, <b>Qutubis</b> und <b>Global Jidahist</b>
<ul class="org-ul">
<li>die letzten 2 Kategorien werden als Jihadisten eingeordnet, die anderen nicht</li>
</ul></li>
</ul></li>
<li>zusammen ergeben diese beiden Quellen Assesments von 33 der Gelehrten (20 Jihadisten, 13 Nichtjihadisten) zu denen Nielsen 11.045 Texte gesammelt hat</li>
</ul></li>
</ol>

<p>
detailliertes Vorgehen und Ergebnisse auf Seite 11 - 15
</p>
</div>
</div>
<div id="outline-container-org4565e56" class="outline-3">
<h3 id="org4565e56"><span class="section-number-3">5.2</span> Reaktionen auf Snowden in China und in Nahost</h3>
<div class="outline-text-3" id="text-5-2">
<ul class="org-ul">
<li>illustratives Beispiel das zeigt wie maschinelle Übersetzung genutzt zsm mit STM werden kann um Vergleiche über Länder und Sprachen hinweg anzustellen</li>
<li>es sei wichtig zu verstehen wie andere Länder die USA finden/bewerten
<ul class="org-ul">
<li>eine Möglichkeit um dies rauszufinden ist mit Hilfe eines Vergleichs von Responses zu bestimmten Ereignissen</li>
</ul></li>
<li>Sammlung von tausenden Social Media Posts in Arabisch &amp; Chinesisch im Juni 2013, dem Monat als Edward Snowden die Whistle geblowt hat
<ul class="org-ul">
<li>Fokus auf Antworten aus China und Nahost (wichtige strateg. Regionen für die USA)</li>
</ul></li>
</ul>
</div>
<div id="outline-container-org7a66687" class="outline-4">
<h4 id="org7a66687"><span class="section-number-4">5.2.1</span> Two approaches to machine translation</h4>
<div class="outline-text-4" id="text-5-2-1">
<ul class="org-ul">
<li>idealerweise Analyse der beiden Datensätze im selben topic model
<ul class="org-ul">
<li>ohne zu übersetzen würde es allerdings keine (vokabularen) Überschneidungen geben
<ul class="org-ul">
<li>dann hätte jeder Korpus eigene indivuelle Topics weil "Snowden" auf Arabisch /neq "Snowden" auf Chinesisch (aber beide selbes Topic "Snowden") und Inhaltsvergleich der Themen somit nicht realisierbar</li>
</ul></li>
</ul></li>
</ul>

<p>
daher Übersetzung der gesamten Korpora, sowie Übersetzung von Begriffen der DTM mit Hilfe von Google Translate durch `translateR`
</p>
<ul class="org-ul">
<li>ersteres weil beim gesamten Text der Kontext fuer die Übersetzung erhalten bleibt</li>
<li>zweiteres weil es nur die minimal benötigten Worte (am meisten relevant) übersetzt
<ul class="org-ul">
<li>individuelle Erstellung der DTM für jede Sprache &rarr; Übersetzung der jeweiligen Terms &rarr; Merge der übersetzten DTM's</li>
</ul></li>
<li>Sicherstellen das kein Topic exklusiv im Kontext einer Sprache existiert</li>
</ul>
</div>
</div>
<div id="outline-container-orgf4439f8" class="outline-4">
<h4 id="orgf4439f8"><span class="section-number-4">5.2.2</span> Correcting for systematic differences between languages</h4>
<div class="outline-text-4" id="text-5-2-2">
<ul class="org-ul">
<li>words that mean the same thing in the Chinese and Arabic corpus could sometimes map onto different words in English that are synonyms of each other</li>
</ul>

<p>
&rarr; "Within the STM, we can use a content covariate to capture variations in word use attributable to observed covariates. Here we include the document's original language as a content covariate in order to capture linguistic differences in describing a topic. This allows us to effectively marginalize over differences in word rate use that arise due to linguistic differences or errors in translation"
</p>
</div>
</div>
<div id="outline-container-orgc56dd7c" class="outline-4">
<h4 id="orgc56dd7c"><span class="section-number-4">5.2.3</span> Results</h4>
<div class="outline-text-4" id="text-5-2-3">
<p>
detailliertes Vorgehen &amp; Ergebnisse auf Seite 17 - 21
</p>
</div>
</div>
</div>
</div>
<div id="outline-container-org1bf4fd0" class="outline-2">
<h2 id="org1bf4fd0"><span class="section-number-2">6</span> Conclusion</h2>
<div class="outline-text-2" id="text-6">
<p>
Seite 21 - 22 nicht so relevant da nur eine Zusammenfassung des bereits aufgeführten Vorgehens
</p>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Created: 2018-06-03 Sun 14:34</p>
<p class="validation"><a href="http://validator.w3.org/check?uri=referer">Validate</a></p>
</div>
</body>
</html>
