uni/politikwissenschaft/Textanalyse/07_Grundlagen_der_automatischen_Textanalyse/notes_lucas.tex
\subsection{Jihadi Fatwas}
\label{sec:org3fb0c25}
Kombination von Daten über musl. Gelehrte und Kodierungen im Bezug darauf ob Gelehrte Jihadisten sind, um herauszufinden wie der Themensinhalt von Texten die von jihadist. Gelehrten sich von Nichtjihadisten unterscheiden:
\begin{enumerate}
\item Data von Nielsen: Daten über das Leben und Schriften von 101 bekannten jihad. und nicht-jihad. musl. Gelehrten inklusive 27.248 Texte von diesen
\begin{itemize}
\item Großteil dieser Texte sind fatwas
\item aber auch Bücher, Artikel und Schriften
\item diese Texte zeigen wie Gelehrte mit religiösen Konstitutionen(Wählerschichten?) interagieren
\end{itemize}
\item Unabhängige Kodierungen ob diese Gelehrten Jihadistens sind
\item 2 Quellen:
\begin{itemize}
\item \emph{Militant Ideology Atlas} = führt 56 Individuen an die regelmäßig/oft von Jihadisten zitiert werden
\item Auflistung von bekannten Gelehrten in 8 ideologischen Kategorieren (Jarret Brachman):
\begin{itemize}
\item Salafist, Madkhali Salafist, Albani Salafist, scientific Salafist, Salafist Ikhwan, Sururis, \textbf{Qutubis} und \textbf{Global Jidahist}
\begin{itemize}
\item die letzten 2 Kategorien werden als Jihadisten eingeordnet, die anderen nicht
\end{itemize}
\end{itemize}
\item zusammen ergeben diese beiden Quellen Assesments von 33 der Gelehrten (20 Jihadisten, 13 Nichtjihadisten) zu denen Nielsen 11.045 Texte gesammelt hat
\end{itemize}
\end{enumerate}

detailliertes Vorgehen und Ergebnisse auf Seite 11 - 15
\subsection{Reaktionen auf Snowden in China und in Nahost}
\label{sec:org1e5935b}
\begin{itemize}
\item illustratives Beispiel das zeigt wie maschinelle Übersetzung genutzt zsm mit STM werden kann um Vergleiche über Länder und Sprachen hinweg anzustellen
\item es sei wichtig zu verstehen wie andere Länder die USA finden/bewerten
\begin{itemize}
\item eine Möglichkeit um dies rauszufinden ist mit Hilfe eines Vergleichs von Responses zu bestimmten Ereignissen
\end{itemize}
\item Sammlung von tausenden Social Media Posts in Arabisch \& Chinesisch im Juni 2013, dem Monat als Edward Snowden die Whistle geblowt hat
\begin{itemize}
\item Fokus auf Antworten aus China und Nahost (wichtige strateg. Regionen für die USA)
\end{itemize}
\end{itemize}
\subsubsection{Two approaches to machine translation}
\label{sec:org7b75182}
\begin{itemize}
\item idealerweise Analyse der beiden Datensätze im selben topic model
\begin{itemize}
\item ohne zu übersetzen würde es allerdings keine (vokabularen) Überschneidungen geben
\begin{itemize}
\item dann hätte jeder Korpus eigene indivuelle Topics weil "Snowden" auf Arabisch /neq "Snowden" auf Chinesisch (aber beide selbes Topic "Snowden") und Inhaltsvergleich der Themen somit nicht realisierbar
\end{itemize}
\end{itemize}
\end{itemize}

daher Übersetzung der gesamten Korpora, sowie Übersetzung von Begriffen der DTM mit Hilfe von Google Translate durch `translateR`
\begin{itemize}
\item ersteres weil beim gesamten Text der Kontext fuer die Übersetzung erhalten bleibt
\item zweiteres weil es nur die minimal benötigten Worte (am meisten relevant) übersetzt
\begin{itemize}
\item individuelle Erstellung der DTM für jede Sprache \(\rightarrow\) Übersetzung der jeweiligen Terms \(\rightarrow\) Merge der übersetzten DTM's
\end{itemize}
\item Sicherstellen das kein Topic exklusiv im Kontext einer Sprache existiert
\end{itemize}
\subsubsection{Correcting for systematic differences between languages}
\label{sec:org54d4b12}
\begin{itemize}
\item words that mean the same thing in the Chinese and Arabic corpus could sometimes map onto different words in English that are synonyms of each other
\end{itemize}

\(\rightarrow\) "Within the STM, we can use a content covariate to capture variations in word use attributable to observed covariates. Here we include the document's original language as a content covariate in order to capture linguistic differences in describing a topic. This allows us to effectively marginalize over differences in word rate use that arise due to linguistic differences or errors in translation"
\subsubsection{Results}
\label{sec:orgb1f3e15}
detailliertes Vorgehen \& Ergebnisse auf Seite 17 - 21
\section{Conclusion}
\label{sec:org140f689}
Seite 21 - 22 nicht so relevant da nur eine Zusammenfassung des bereits aufgeführten Vorgehens
\end{document}
